package ru.sibdigital.proccovid.dto;

import ru.sibdigital.proccovid.dto.egrip040501.Файл;

import java.util.List;

public class EgripNodes {
    private Файл.Документ.СвИП.СвОКВЭД  свОКВЭД;
    private Файл.Документ.СвИП.СвРегОрг свРегОрг;
    private Файл.Документ.СвИП.СвРегПФ  свРегПФ;
    private Файл.Документ.СвИП.СвРегФСС свРегФСС;
    private Файл.Документ.СвИП.СвСтатус свСтатус;
    private List<Файл.Документ.СвИП.СвЗапЕГРИП> свЗапЕГРИП;

    public EgripNodes(Файл.Документ.СвИП свИП) {
        this.setСвОКВЭД(свИП.getСвОКВЭД());
        this.setСвРегОрг(свИП.getСвРегОрг());
        this.setСвРегПФ(свИП.getСвРегПФ());
        this.setСвРегФСС(свИП.getСвРегФСС());
        this.setСвСтатус(свИП.getСвСтатус());
        this.setСвЗапЕГРИП(свИП.getСвЗапЕГРИП());
    }

    public Файл.Документ.СвИП.СвОКВЭД getСвОКВЭД() {
        return свОКВЭД;
    }
    public void setСвОКВЭД(Файл.Документ.СвИП.СвОКВЭД свОКВЭД) {
        this.свОКВЭД = свОКВЭД;
    }

    public Файл.Документ.СвИП.СвРегОрг getСвРегОрг() {
        return свРегОрг;
    }
    public void setСвРегОрг(Файл.Документ.СвИП.СвРегОрг свРегОрг) {
        this.свРегОрг = свРегОрг;
    }

    public Файл.Документ.СвИП.СвРегПФ getСвРегПФ() {
        return свРегПФ;
    }
    public void setСвРегПФ(Файл.Документ.СвИП.СвРегПФ свРегПФ) {
        this.свРегПФ = свРегПФ;
    }

    public Файл.Документ.СвИП.СвРегФСС getСвРегФСС() {
        return свРегФСС;
    }
    public void setСвРегФСС(Файл.Документ.СвИП.СвРегФСС свРегФСС) {
        this.свРегФСС = свРегФСС;
    }

    public Файл.Документ.СвИП.СвСтатус getСвСтатус() {
        return свСтатус;
    }
    public void setСвСтатус(Файл.Документ.СвИП.СвСтатус свСтатус) {
        this.свСтатус = свСтатус;
    }

    public List<Файл.Документ.СвИП.СвЗапЕГРИП> getСвЗапЕГРИП() {
        return свЗапЕГРИП;
    }
    public void setСвЗапЕГРИП(List<Файл.Документ.СвИП.СвЗапЕГРИП> свЗапЕГРИП) {
        this.свЗапЕГРИП = свЗапЕГРИП;
    }
}
