INSERT INTO public.cls_template (key, value) VALUES ('1402', '<p><strong>Уважаемый пользователь портала &laquo;Работающая Бурятия&raquo;!</strong><br />В целях исполнения Указа Главы Республики Бурятия от &hellip; № &hellip; Вам необходимо актуализировать информацию о &hellip; &hellip; в ранее поданной заявке.&nbsp;Для удобства воспользуйтесь ссылкой <a href=":link">:link</a><br />Инструкция:</p>
<p>1. Воспользуйтесь ссылкой, приведенной в письме, для загрузки формы ранее поданной заявки на портале &laquo;Работающая Бурятия&raquo;. (Вы можете ее скопировать в браузер)</p>
<p>&nbsp;2. Актуализируйте данные в загруженной форме в разделе &laquo;ДАННЫЕ О ЧИСЛЕННОСТИ РАБОТНИКОВ&raquo; и&nbsp; &laquo;ДАННЫЕ О ВАШИХ РАБОТНИКАХ, ЧЬЯ ДЕЯТЕЛЬНОСТЬ ПРЕДУСМАТРИВАЕТ ВЫХОД НА РАБОТУ&raquo;&nbsp;</p>
<p>3. Ознакомитесь и согласитесь с выполнением требований предписания по соблюдению &hellip;</p>
<p>4. Отправьте данные используя кнопку &laquo;Актуализировать&raquo; в нижней части формы.&nbsp;</p>
<p>После успешного выполнения п.4 инструкции данные заявка будет актуализирована на портале &laquo;Работающая Бурятия&raquo;&nbsp;Используйте для работы с порталом &laquo;Работающая Бурятия&raquo; браузер Google Chrome или Яндекс.Браузер<br />Вопросы по заполнению, замечания и предложения направляете на электронную почту rabota03@govrb.ru&nbsp;&nbsp;</p>')
;

